In [1]:
import pandas
pandas.__version__

'1.5.3'

In [2]:
import numpy as np
import pandas as pd

In [3]:
counts = pd.Series([10, 32,23,2])
counts

0    10
1    32
2    23
3     2
dtype: int64

In [5]:
counts.values

array([10, 32, 23,  2], dtype=int64)

In [6]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [14]:
cartoon=pd.Series([10,32,2,23],
index=['Oggy','Olly','serri','sunshine'])

cartoon

Oggy        10
Olly        32
serri        2
sunshine    23
dtype: int64

In [16]:
cartoon['serri']

2

In [18]:
cartoon.name = 'counts'
cartoon.index.name = 'cartoons'
cartoon

cartoons
Oggy        10
Olly        32
serri        2
sunshine    23
Name: counts, dtype: int64

In [19]:
np.log(cartoon)

cartoons
Oggy        2.302585
Olly        3.465736
serri       0.693147
sunshine    3.135494
Name: counts, dtype: float64

In [20]:
cartoon_dict = {'Oggy':10,'Olly':32,'serri':2,'sunshine':23}
print(cartoon_dict)
pd.Series(cartoon_dict)

{'Oggy': 10, 'Olly': 32, 'serri': 2, 'sunshine': 23}

Oggy        10
Olly        32
serri        2
sunshine    23
dtype: int64

In [26]:
anime = {"char":["naruto","hinata","sasuke","sakura"],
         "year":[2001,2002,2001,2002],
        "nija":['yes','yes','yes','no']}
print(anime)
anime = pd.DataFrame(anime)
anime

{'char': ['naruto', 'hinata', 'sasuke', 'sakura'], 'year': [2001, 2002, 2001, 2002], 'nija': ['yes', 'yes', 'yes', 'no']}

     char  year nija
0  naruto  2001  yes
1  hinata  2002  yes
2  sasuke  2001  yes
3  sakura  2002   no

In [28]:
df = pd.DataFrame(anime,columns=["year","char","nija"])
df

   year    char nija
0  2001  naruto  yes
1  2002  hinata  yes
2  2001  sasuke  yes
3  2002  sakura   no

In [30]:
df['Serie_aligned']= pd.Series(range(4), index=[0,1,2,3])
df

   year    char nija  Serie_aligned
0  2001  naruto  yes              0
1  2002  hinata  yes              1
2  2001  sasuke  yes              2
3  2002  sakura   no              3

In [31]:
df.to_dict()

{'year': {0: 2001, 1: 2002, 2: 2001, 3: 2002},
 'char': {0: 'naruto', 1: 'hinata', 2: 'sasuke', 3: 'sakura'},
 'nija': {0: 'yes', 1: 'yes', 2: 'yes', 3: 'no'},
 'Serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3}}

In [33]:
pd.DataFrame(df.to_dict())

   year    char nija  Serie_aligned
0  2001  naruto  yes              0
1  2002  hinata  yes              1
2  2001  sasuke  yes              2
3  2002  sakura   no              3

In [37]:
data = [{'a':i, 'b':10* i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [38]:
pd.DataFrame([{'aa':1,'bb':2},{'bb':3,'cc':6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [39]:
pd.DataFrame(np.random.randint(2,12),
             columns=['foo','bar'],
             index=['a','b','c'])

   foo  bar
a    7    7
b    7    7
c    7    7

In [40]:
ind = pd.Index([20,34,57,7,1,8])
ind

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [41]:
ind[1]

34

In [42]:
ind[::]

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [44]:
print(ind.size,ind.shape,ind.ndim,ind.dtype)

6 (6,) 1 int64

In [46]:
ind[1]=0

TypeError: Index does not support mutable operations

In [47]:
rng = np.random.RandomState(15)
ser = pd.Series(rng.randint(0, 10,4))
ser

0    8
1    5
2    5
3    7
dtype: int32

In [48]:
dfr = pd.DataFrame(rng.randint(0,10,(5,4)),
                   columns=['a','b','c','d'])
dfr

   a  b  c  d
0  0  7  5  6
1  1  7  0  4
2  9  7  5  3
3  6  8  2  1
4  1  0  5  2

In [49]:
np.exp(ser)

0    2980.957987
1     148.413159
2     148.413159
3    1096.633158
dtype: float64

In [50]:
np.sin(dfr*np.pi/4)

          a             b         c             d
0  0.000000 -7.071068e-01 -0.707107 -1.000000e+00
1  0.707107 -7.071068e-01  0.000000  1.224647e-16
2  0.707107 -7.071068e-01 -0.707107  7.071068e-01
3 -1.000000 -2.449294e-16  1.000000  7.071068e-01
4  0.707107  0.000000e+00 -0.707107  1.000000e+00

In [53]:
nija = pd.Series({'itachi':1678548,'obito':4563668,'madara':876538},name='war')
death= pd.Series({'itachi':2000000,'obito':1500000,'madara':5000000},name='death')

print(area)
death

itachi    1678548
obito     4563668
madara     876538
Name: war, dtype: int64

itachi    2000000
obito     1500000
madara    5000000
Name: death, dtype: int64

In [54]:
death/nija

itachi    1.191506
obito     0.328683
madara    5.704259
dtype: float64

In [56]:
nija.index | death.index

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_25008\874496032.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  nija.index | death.index

Index(['itachi', 'obito', 'madara'], dtype='object')

In [57]:
df

   year    char nija  Serie_aligned
0  2001  naruto  yes              0
1  2002  hinata  yes              1
2  2001  sasuke  yes              2
3  2002  sakura   no              3

In [60]:
df2=pd.DataFrame({"char":["naruto","hinata","sasuke"],"num":["10000","20000","30000"]})
df2

     char    num
0  naruto  10000
1  hinata  20000
2  sasuke  30000

In [61]:
df.merge(df2)

   year    char nija  Serie_aligned    num
0  2001  naruto  yes              0  10000
1  2002  hinata  yes              1  20000
2  2001  sasuke  yes              2  30000